-- phpMyAdmin SQL Dump
-- version 4.0.10.20
-- https://www.phpmyadmin.net
--
-- โฮสต์: localhost
-- เวลาในการสร้าง: 17 ก.ค. 2026  14:20น.
-- เวอร์ชั่นของเซิร์ฟเวอร์: 5.1.73
-- รุ่นของ PHP: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- ฐานข้อมูล: `yamafinance`
--

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `donation_items`
--

CREATE TABLE IF NOT EXISTS `donation_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `donor_id` int(11) NOT NULL,
  `merit_id` int(11) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `donation_date` date NOT NULL,
  `receipt_name` varchar(255) DEFAULT NULL,
  `item_code` varchar(50) NOT NULL,
  `create_by` int(11) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) DEFAULT '0',
  `deleted_by` int(11) DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `comment` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `donation_id` (`donor_id`),
  KEY `merit_id` (`merit_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `donors`
--

CREATE TABLE IF NOT EXISTS `donors` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `full_name` varchar(255) NOT NULL,
  `birth_date` date DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `line_id` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- dump ตาราง `donors`
--

INSERT INTO `donors` (`id`, `full_name`, `birth_date`, `phone`, `line_id`, `created_at`, `is_deleted`) VALUES
(1, 'พระธเนศ วรจิตฺโต', '0000-00-00', '', '', '2026-07-17 01:56:46', 0),
(2, 'กัลฯ อัมพร ฮานาวะ', '0000-00-00', '', '', '2026-07-17 01:58:03', 0);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `expenses`
--

CREATE TABLE IF NOT EXISTS `expenses` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `expense_code` varchar(20) DEFAULT NULL,
  `expense_date` date NOT NULL,
  `category_id` int(11) NOT NULL,
  `vendor_id` int(11) DEFAULT NULL,
  `detail` varchar(250) DEFAULT NULL,
  `amount` decimal(14,2) NOT NULL,
  `payment_method` enum('cash','transfer','card') NOT NULL,
  `uploaded` varchar(100) DEFAULT '0',
  `created_by` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT NULL,
  `is_deleted` tinyint(1) DEFAULT '0',
  `deleted_by` int(11) DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `category_id` (`category_id`),
  KEY `vendor_id` (`vendor_id`),
  KEY `created_by` (`created_by`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=35 ;

--
-- dump ตาราง `expenses`
--

INSERT INTO `expenses` (`id`, `expense_code`, `expense_date`, `category_id`, `vendor_id`, `detail`, `amount`, `payment_method`, `uploaded`, `created_by`, `created_at`, `updated_at`, `is_deleted`, `deleted_by`, `deleted_at`) VALUES
(1, '2026/06-001', '2026-06-01', 89, 1, 'ค่าธรรมเนียมทำลายซากรถยนต์', '1700.00', 'cash', '202606-001.jpg', 0, '2026-07-16 06:20:09', NULL, 0, NULL, NULL),
(2, '2026/06-002', '2026-06-01', 21, 2, 'ไปรษณียบัตร(Postcard)', '340.00', 'cash', '202606-002.jpg', 0, '2026-07-16 06:27:13', NULL, 0, NULL, NULL),
(3, '2026/06-003', '2026-06-01', 61, 3, 'วัสดุคอมพิวเตอร์', '330.00', 'cash', '202606-003.jpg', 0, '2026-07-16 06:31:16', NULL, 0, NULL, NULL),
(4, '2026/06-004', '2026-06-01', 29, 4, 'อาหาร', '1080.00', 'cash', '202606-004.jpg', 0, '2026-07-16 06:36:51', NULL, 0, NULL, NULL),
(5, '2026/06-005', '2026-06-01', 29, 5, 'อาหาร', '128.00', 'cash', '202606-005.jpg', 0, '2026-07-16 06:38:30', NULL, 0, NULL, NULL),
(6, '2026/06-006', '2026-06-01', 21, 2, 'ค่าแสตมป์', '460.00', 'cash', '202606-006.jpg', 0, '2026-07-16 06:41:17', NULL, 0, NULL, NULL),
(7, '2026/06-007', '2026-06-01', 59, 6, 'เครืองใช้ไฟฟ้า', '1980.00', 'cash', '202606-007.jpg', 0, '2026-07-16 06:45:27', NULL, 0, NULL, NULL),
(8, '2026/06-008', '2026-06-01', 57, 7, '天丸ネジ 3.5×50-D-08 (สกรูหัวกลม 3.5×50 มม.) วัสดุก่อสร้าง / อุปกรณ์งานช่าง', '808.00', 'cash', '202606-008.jpg', 0, '2026-07-16 06:51:21', NULL, 0, NULL, NULL),
(9, '2026/06-009', '2026-06-02', 57, 8, 'แผ่นฝ้า', '12936.00', 'cash', '202606-009.jpg', 0, '2026-07-16 06:53:32', NULL, 0, NULL, NULL),
(10, '2026/06-010', '2026-06-02', 57, 9, 'หลอดไฟ LED แบบ COB', '4779.00', 'cash', '202606-010.jpg', 0, '2026-07-16 06:58:08', NULL, 0, NULL, NULL),
(11, '2026/06-011', '2026-06-02', 57, 10, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '4169.00', 'cash', '202606-011.jpg', 0, '2026-07-16 08:14:07', NULL, 0, NULL, NULL),
(12, '2026/06-012', '2026-06-03', 57, 10, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '19018.00', 'cash', '202606-012.jpg', 0, '2026-07-16 08:14:52', NULL, 0, NULL, NULL),
(13, '2026/06-013', '2026-06-08', 18, 11, 'น้ำมันรถยนต์', '5000.00', 'cash', '202606-013.jpg', 0, '2026-07-16 08:17:13', NULL, 0, NULL, NULL),
(14, '2026/06-014', '2026-06-09', 57, 8, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '877.00', 'cash', '202606-014.jpg', 0, '2026-07-16 08:24:24', NULL, 0, NULL, NULL),
(15, '2026/06-015', '2026-06-11', 50, 12, 'ค่าเบี้ยประกันรถยนต์', '127500.00', 'cash', '202606-015.jpg', 0, '2026-07-16 09:11:18', NULL, 0, NULL, NULL),
(16, '2026/06-016', '2026-06-11', 21, 2, 'ค่าขนส่งไปรษณีย์', '2380.00', 'cash', '202606-016.jpg', 0, '2026-07-16 09:15:47', NULL, 0, NULL, NULL),
(17, '2026/06-017', '2026-06-12', 57, 9, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '2417.00', 'cash', '202606-017.jpg', 0, '2026-07-16 09:17:18', NULL, 0, NULL, NULL),
(18, '2026/06-018', '2026-06-12', 29, 4, 'วัตถุดิบทำอาหาร', '3082.00', 'cash', '202606-018.jpg', 0, '2026-07-16 09:18:39', NULL, 0, NULL, NULL),
(19, '2026/06-019', '2026-06-12', 44, 13, 'ของใช้อุปโภค', '550.00', 'cash', '202606-019.jpg', 0, '2026-07-16 09:25:53', NULL, 0, NULL, NULL),
(20, '2026/06-020', '2026-06-13', 30, 14, 'ปานะ', '450.00', 'cash', '202606-020.jpg', 0, '2026-07-16 09:28:27', NULL, 0, NULL, NULL),
(21, '2026/06-021', '2026-06-15', 57, 10, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '16170.00', 'cash', '202606-021.jpg', 0, '2026-07-16 09:29:37', NULL, 0, NULL, NULL),
(22, '2026/06-022', '2026-06-16', 43, 15, 'ค่าบำบัดน้ำเสีย', '15000.00', 'cash', '202606-022.jpg', 0, '2026-07-16 09:44:44', NULL, 0, NULL, NULL),
(23, '2026/06-023', '2026-06-16', 30, 16, 'ปานะ', '1996.00', 'cash', '202606-023.jpg', 0, '2026-07-16 09:45:53', NULL, 0, NULL, NULL),
(24, '2026/06-024', '2026-06-17', 57, 8, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '5016.00', 'cash', '202606-024.jpg', 0, '2026-07-16 09:46:58', NULL, 0, NULL, NULL),
(25, '2026/06-025', '2026-06-17', 29, 4, 'วัตถุดิบทำอาหาร', '137.00', 'cash', '202606-025.jpg', 0, '2026-07-16 09:52:12', NULL, 0, NULL, NULL),
(26, '2026/06-026', '2026-06-19', 29, 4, 'วัตถุดิบทำอาหาร', '1406.00', 'cash', '202606-026.jpg', 0, '2026-07-16 09:53:12', NULL, 0, NULL, NULL),
(27, '2026/06-027', '2026-06-19', 57, 17, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '220.00', 'cash', '202606-027.jpg', 0, '2026-07-16 09:54:01', NULL, 0, NULL, NULL),
(28, '2026/06-028', '2026-06-24', 57, 18, 'วัสดุอุปกรณ์งานช่าง / วัสดุก่อสร้าง', '11646.00', 'cash', '202606-028.jpg', 0, '2026-07-16 09:56:23', NULL, 0, NULL, NULL),
(29, '2026/06-029', '2026-06-30', 74, 19, 'ค่าแก๊ส', '2063.00', 'cash', '202606-029.jpg', 0, '2026-07-16 09:59:33', NULL, 0, NULL, NULL),
(30, '2026/06-030', '2026-06-30', 74, 19, 'ค่าแก๊ส', '10336.00', 'cash', '202606-030.jpg', 0, '2026-07-16 10:02:00', NULL, 0, NULL, NULL),
(31, '2026/06-031', '2026-06-01', 29, 20, 'วัตถุดิบทำอาหาร', '2652.00', 'cash', '202606-031.jpg', 0, '2026-07-16 10:08:26', NULL, 0, NULL, NULL),
(32, '2026/06-032', '2026-06-01', 29, 21, 'วัตถุดิบทำอาหาร', '1319.00', 'cash', '202606-032.jpg', 0, '2026-07-16 10:10:55', NULL, 0, NULL, NULL),
(33, '2026/06-033', '2026-06-01', 29, 4, 'วัตถุดิบทำอาหาร', '1901.00', 'cash', '202606-033.jpg', 0, '2026-07-16 10:12:10', NULL, 0, NULL, NULL),
(34, '2026/06-034', '2026-06-01', 29, 22, 'วัตถุดิบทำอาหาร', '2582.00', 'cash', '202606-034.jpg', 0, '2026-07-16 10:16:39', NULL, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `expense_categories`
--

CREATE TABLE IF NOT EXISTS `expense_categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` text,
  `disable` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=91 ;

--
-- dump ตาราง `expense_categories`
--

INSERT INTO `expense_categories` (`id`, `name`, `description`, `disable`) VALUES
(1, '010 ครุภัณฑ์หนัก (เครื่องจักรกำลังสูง)', NULL, 0),
(2, '020 ครุภัณฑ์ทั่วไป', NULL, 0),
(3, '030 ค่าใช้จ่ายโครงการปฏิบัติธรรมพิเศษ, เช่าจัดงาน', NULL, 0),
(4, '040 ค่าใช้จ่ายวิทยากรและรับรองแขก', NULL, 0),
(5, '050 ค่าเช่ารถ', NULL, 0),
(6, '060 ค่าอัฏฐบริขาร, เครื่องใช้ในงานพิธีกรรม, อุปกรณ์ระดมทุน', NULL, 0),
(7, '070 ค่าสื่อธรรมะ', NULL, 0),
(8, '090 ค่าของที่ระลึก,ค่าทำกรอบพระ', NULL, 0),
(9, '100 ร่วมบุญกองทุนเผยแผ่คนญี่ปุ่น', NULL, 0),
(10, '110 ค่าธรรมเนียมในการรับของจากสนามบิน ท่าเรือ (รวมค่าเช่ารถรับของสนามบิน/ท่าเรือ)', NULL, 0),
(11, '120 ค่าวัสดุและรับเหมาตัดเย็บ', NULL, 0),
(12, '130 ค่าวัสดุโฆษณาและเผยแผ่, ค่าถ่ายเอกสาร, ค่าพิมพ์ปฏิทิน', NULL, 0),
(13, '140 ค่าใช้จ่ายที่เมืองไทยในการส่งของมาญี่ปุ่น', NULL, 0),
(14, '150 ค่าอาหารและปานะสำหรับบูชาข้าวพระ', NULL, 0),
(15, '160 ค่าดอกไม้และวัสดุจัดดอกไม้', NULL, 0),
(16, '170 ค่าปล่อยสัตว์, ปล่อยปลา', NULL, 0),
(17, '180 ค่าเดินทางเพื่อการเผยแผ่, ตั๋วเครื่องบิน', NULL, 0),
(18, '190 ค่าน้ำมันรถ', NULL, 0),
(19, '200 ค่าธรรมเนียมทางด่วน/ค่าจอดรถ', NULL, 0),
(20, '210 ค่าโทรศัพท์', NULL, 0),
(21, '220 ค่าไปรษณีย์', NULL, 0),
(22, '230 ค่าเช่าหน่วยความจำ server, dropbox, ค่าเช่าโปรแกรมzoom, ค่าเช่าเว็บไซต์', NULL, 0),
(23, '240 ค่าโทรศัพท์มือถือ', NULL, 0),
(24, '250 ค่าอินเตอร์เนต', NULL, 0),
(25, '260 ค่าเช่าเครื่องมือสื่อสาร-ค่าเช่าสายโทรศัพท์', NULL, 0),
(26, '270 ค่าหนังสือ, อุปกรณ์การเรียน, ดีโอยู, ค่าธรรมเนียมสมาชิก', NULL, 0),
(27, '280 ค่าหนังสือพิมพ์', NULL, 0),
(28, '300 ค่าพิมพ์อื่นๆ (โบว์ชัวร์,นามบัตร,จดหมาย), วัสดุสิ่งพิมพ์, ค่าพิมพ์วารสารประกายธรรม', NULL, 0),
(29, '310 ค่าอาหาร', NULL, 0),
(30, '320 ค่าปานะ', NULL, 0),
(31, '330 ค่าเล่าเรียนพระภิกษุ-สามเณร', NULL, 0),
(32, '340 ค่าเล่าเรียนบุคลากร', NULL, 0),
(33, '350 เงินร่วมบุญต่างๆที่วัดพระธรรมกาย, ปัจจัยร่วมบุญพิเศษต่างๆ', NULL, 0),
(34, '360 เงินบูชาธรรมพระสงฆ์, เงินมอบให้บุคลากร', NULL, 0),
(35, '370 เงินอุดหนุนสาธารณกุศล, ช่วยเหลือน้ำท่วม, สภากาชาด', NULL, 0),
(36, '380 เงินคืนกองทุนกู้ยืมการศึกษา', NULL, 0),
(37, '390 ค่าใช้จ่ายโอนเข้าส่วนกลางญี่ปุ่น, สนับสนุนกองกลางญี่ปุ่น', NULL, 0),
(38, '400 เงินที่โอนให้วัดสาขาต่างๆ', NULL, 0),
(39, '410 ค่าใช้จ่ายกองกลางที่ประเทศไทย, ค่าใช้จ่ายเบ็ดเตล็ด, ค่าเข้าชมสถานที่', NULL, 0),
(40, '420 ค่าชุดอุบาสก-อุบาสิกา มาจำหน่าย, ค่าพิมพ์หนังสือธรรมะมาจำหน่าย', NULL, 0),
(41, '430 ค่าจ้างเหมางานสวนและเกษตรกรรม, ค่าเช่าเครื่องน้ำดื่มน้ำอุ่น', NULL, 0),
(42, '440 ค่าใช้จ่ายศูนย์เผยแผ่คนญี่ปุ่น, ค่าจ้างแปลเอกสาร', NULL, 0),
(43, '450 ค่าสาธารณูปโภคอื่นๆ, ค่าทิ้งขยะ, ค่าบำบัดน้ำเสีย,ค่าซักอบรีด', NULL, 0),
(44, '460 ค่าวัสดุอุปโภค, อุปกรณ์งานบ้าน, น้ำยาต่างๆ', NULL, 0),
(45, '470 ค่าอุปกรณ์เครื่องนอน', NULL, 0),
(46, '480 ค่าเดินทาง (งานทั่วไป,ไปโรงเรียน)', NULL, 0),
(47, '490 ค่าเช่าหอพัก', NULL, 0),
(48, '500 ค่าเช่าสำนักงาน, ค่าเช่าที่จอดรถรายเดือน', NULL, 0),
(49, '510 ค่าประกันอาคาร, ค่าประกันอัคคีภัย', NULL, 0),
(50, '520 ค่าประกันรถยนต์', NULL, 0),
(51, '530 ค่าประกันชีวิต', NULL, 0),
(52, '540 ค่าวัสดุ-ค่าซ่อม-บำรุงรักษารถยนต์-จักรยาน, ตรวจเช็คสภาพรถ', NULL, 0),
(53, '550 ค่าวัสดุ-ค่าซ่อมเครื่องสื่อสาร-ทีวี-เครื่องเสียง-อุปกรณ์อินเตอร์เน็ท', NULL, 0),
(54, '560 ค่าวัสดุ-ค่าซ่อมแซมคอมพิวเตอร์', NULL, 0),
(55, '570 ค่าวัสดุ-ค่าซ่อมแซมเครื่องใช้ไฟฟ้า', NULL, 0),
(56, '580 ค่าวัสดุ-ค่าซ่อมแซมระบบประปา', NULL, 0),
(57, '590 ค่าวัสดุ-ค่าซ่อมแซมระบบไฟฟ้า-อาคาร (ไม่เกินหมื่นเยน)', NULL, 0),
(58, '600 ค่าวัสดุ-ค่าซ่อมเบ็ดเตล็ด', NULL, 0),
(59, '610 เครื่องใช้ไฟฟ้า, เครื่องดูดฝุ่น, เครื่องซักผ้า, เครื่องทำความเย็น-อุ่น, เครื่องซักผ้า', NULL, 0),
(60, '620 อุปกรณ์ถ่ายภาพ, วีดีโอ, เครื่องเสียง', NULL, 0),
(61, '630 ค่าวัสดุคอมพิวเตอร์, หมึกพิมพ์', NULL, 0),
(62, '640 ค่าวัสดุการเกษตร, วัสดุเครื่องครัว, ต้นไม้', NULL, 0),
(63, '650 ค่าวัสดุอุปกรณ์ในรถยนต์', NULL, 0),
(64, '660 ค่าวัสดุสำนักงาน', NULL, 0),
(65, '670 ค่าใช้จ่ายศูนย์เด็ก, วัสดุการกีฬา, เครื่องออกกำลังกาย', NULL, 0),
(66, '680 ค่าภาษีรถยนต์, ต่อทะเบียนรถ', NULL, 0),
(67, '690 ค่าภาษีที่ดินและอาคาร', NULL, 0),
(68, '700 ค่าภาษีประกันสังคม', NULL, 0),
(69, '710 ค่ารางวัด, ค่าจ้างทนาย', NULL, 0),
(70, '720 ค่าจ้างนักบัญชีคนญี่ปุ่น', NULL, 0),
(71, '730 ภาษีรายได้หัก ณ ที่จ่าย', NULL, 0),
(72, '740 เงินช่วยเหลือค่าเล่าเรียนอุบาสกอุบาสิกาวีซ่านักเรียน (เงินเดือน+ค่าประกันสุขภาพ)', NULL, 0),
(73, '750 ค่าน้ำมันก๊าด Heater', NULL, 0),
(74, '760 ค่าแก๊ส', NULL, 0),
(75, '770 ค่าไฟฟ้า', NULL, 0),
(76, '780 ค่าน้ำประปา', NULL, 0),
(77, '790 ค่าธรรมเนียมอื่นๆ, ค่าดำเนินการวีซ่า', NULL, 0),
(78, '800 ค่าธรรมเนียมแลกเงิน, โอนเงิน', NULL, 0),
(79, '810 ปัจจัยเกื้อหนุนพระภิกษุ-เจ้าหน้าที่วีซ่าศาสนา 1 ปีขึ้นไป+ประกันสังคม+ภาษีท้องถิ่น+ค่าประกันสุขภา', NULL, 0),
(80, '820 ปัจจัยเกื้อหนุนพระภิกษุ-เจ้าหน้าที่วีซ่าศาสนา 3 เดือน, ผู้ที่ไม่ได้พักในญี่ปุ่นนานๆ', NULL, 0),
(81, '830 สวัสดิการบุคลากรที่รวมอยู่ในเงินเดือน (ตั๋วเครื่องบิน, ปัจจัยกลับไทย, เครื่องกันหนาว)', NULL, 0),
(82, '840 ค่าตัดผม, ค่าอองเซน, หล่อหลอมบุคลากร สวัสดิการบุคลากรอื่นๆ', NULL, 0),
(83, '850 ค่ารักษาพยาบาล', NULL, 0),
(84, '860 ค่าวัสดุเวชภัณฑ์', NULL, 0),
(85, '870 ค่าซื้อที่ดินสร้างวัด', NULL, 0),
(86, '880 ค่าซื้ออาคารสร้างวัด', NULL, 0),
(87, '890 ค่าซ่อมแซมต่างๆ ในวัด, ค่าอุปกรณ์ช่าง, Reform อาคาร/สิ่งปลูกสร้างเดิม', NULL, 0),
(88, '900 ค่าดำเนินการเกี่ยวกับการซื้อวัดต่างๆ', NULL, 0),
(89, '910 ครุภัณฑ์ยานพาหนะและขนส่ง', NULL, 0),
(90, '920 สร้างอาคารใหม่', NULL, 0);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `merits`
--

CREATE TABLE IF NOT EXISTS `merits` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `merit_name` varchar(255) NOT NULL,
  `description` text,
  `disable` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=23 ;

--
-- dump ตาราง `merits`
--

INSERT INTO `merits` (`id`, `merit_name`, `description`, `disable`) VALUES
(1, 'กองทุนเศรษฐีถาวร', NULL, 0),
(2, 'บูชาข้าวพระ', NULL, 0),
(3, 'ตักบาตร', NULL, 0),
(4, 'ทิพยมาลาบุฟผาสวรรค์', NULL, 0),
(5, 'ภัตตาหารและปานะ', NULL, 0),
(6, 'ปล่อยสัตว์ปล่อยปลา', NULL, 0),
(7, 'บุพพเปตพลีอุทิศให้ผู้ล่วงลับ', NULL, 0),
(8, 'คิลานเภสัช(ยารักษาโรค)', NULL, 0),
(9, 'ถวายสังฆทาน', NULL, 0),
(10, 'ผ้าป่าบำรุงวัด', NULL, 0),
(11, 'ค่าน้ำค่าไฟ', NULL, 0),
(12, 'เครื่องกันหนาว', NULL, 0),
(13, 'น้ำมันเครื่องทำความอุ่น สโต๊ป', NULL, 0),
(14, 'ยานพาหนะ, น้ำมันรถ, ไฟฟ้า(รถ)', NULL, 0),
(15, 'บูชาธรรมหลวงปู่ สด จันทสโร', NULL, 0),
(16, 'บูชาธรรมหลวงพ่อธัมมชโย', NULL, 0),
(17, 'บูชาธรรมหลวงพ่อทัตตชีโว', NULL, 0),
(18, 'บูชาธรรมคุณยายอาจารย์ฯ', NULL, 0),
(19, 'บูชาธรรมพระอาจารย์', NULL, 0),
(20, 'ทอดผ้าป่าเดือนเกิด', NULL, 0),
(21, 'บูชาพระมหาธรรมกายเจดีย์', NULL, 0),
(22, 'กฐินประจำปี พ.ศ. 2569', NULL, 0);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `role` enum('admin','accountant','data_entry') NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_active` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- dump ตาราง `users`
--

INSERT INTO `users` (`id`, `username`, `password_hash`, `role`, `full_name`, `created_at`, `is_active`) VALUES
(1, 'potter1326', '$2y$10$GXAZS/4dzV4TSYR.ZxZW8uijA5csAwLtmEmeYvsk84880PtoxS6Fe', 'admin', 'ธเนศ วรจิตฺโต', '2026-07-13 02:17:56', 1),
(2, 'test', '$2y$10$QUb5osN9Hg..WVyTd4My5.GjWmxvQtiQ1SG6QYlYBf3.nlgZ.SEdC', 'accountant', 'ทดสอบ', '2026-07-13 03:57:11', 1),
(3, 'test2', '$2y$10$jtM4sj5UwUHQwCKE1PX6SuBU0iS3KDkR80/v6udHPjC5t5Eh.K0MK', 'data_entry', 'ทดสอบ', '2026-07-13 04:13:13', 0),
(4, 'test3', '$2y$10$vgND/jDNJy1pNeWBSy7m8OUwG2DLiwIMMCmCnoDWW9gLbSVShBX.y', 'data_entry', 'ทดสอบ3', '2026-07-16 01:42:15', 0);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `vendors`
--

CREATE TABLE IF NOT EXISTS `vendors` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `vendor_name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `disable` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=23 ;

--
-- dump ตาราง `vendors`
--

INSERT INTO `vendors` (`id`, `vendor_name`, `description`, `disable`) VALUES
(1, 'Yamanashi Kaitai Center Co., Ltd.', '', 0),
(2, '日本郵便株式会社 (Japan Post Co., Ltd.)', 'ไปรษณีย์ญี่ปุ่น', 0),
(3, 'Hard-Off', '', 0),
(4, 'AEON', '', 0),
(5, 'OGINO', '', 0),
(6, 'Book-Off', '', 0),
(7, '株式会社コメリ (Komeri Co., Ltd.)', '', 0),
(8, 'DCM', '', 0),
(9, 'Super Viva Home', '', 0),
(10, 'PRO', '', 0),
(11, '株式会社シミズヤ (Shimizuya Co., Ltd.)', '', 0),
(12, 'Nissan', '', 0),
(13, 'Seria', '', 0),
(14, 'Kaldi Cofee Farm', '', 0),
(15, '有限会社 富士メンテナンス(Fuji Maintenance Co., Ltd.)', '', 0),
(16, 'Starbucks', '', 0),
(17, 'Daiso', '', 0),
(18, 'Trial', '', 0),
(19, '鈴与商事株式会社 甲府LPGセンター (Suzuyo Shoji Co., Ltd. – Kofu LPG Center)', '', 0),
(20, '天野肉店 (Amano Meat Shop)', '', 0),
(21, '萩原青果 (Hagihara Seika)', '', 0),
(22, '業務スーパー (Gyomu Super)', '', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
